XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3Basic_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>https://www.keil.com/pack/</url>
  <name>FM3Basic_DFP</name>
  <description>Cypress FM3 Basic Series Device Support</description>

  <releases>
    <release version="1.1.1" date="2023-09-03" deprecated="2023-09-04">
      This Software Pack is no longer maintained. Please contact the device vendor (Cypress) for support.
	</release>
    <release version="1.1.0" date="2019-05-28">
      Updated pdsc file: 
      - updated Device Vendor: changed from Spansion to Cypress.
      - updated for file name consistency.
      - added features to device descriptions.
    </release>
    <release version="1.0.0">
      First Release version of FM3 Basic Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Cypress</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Cypress</keyword>
    <keyword>FM3 Basic</keyword>
    <keyword>MB9A</keyword>
    <keyword>MB9B</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="FM3 Basic Series" Dvendor="Cypress:19">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p1"/>
      <book    name="Documents/dui0552a_cortex_m3_dgug.pdf"           title="Cortex-M3 Generic User Guide"/>
        <description>
The FM3 Series is designed for cost-sensitive embedded control applications.
Typical applications include Industrial, Motor control, Factory automation, White goods, Power tools, Medical and healthcare, Hand-held devices

  - highly reliable Flash (100,000 erase/write cycles) with 0 wait states at 72MHz)
  - long term availablity (> 10 years)
        </description>

      <!-- ************************  Subfamily 'MB9AF100'  **************************** -->
      <subFamily DsubFamily="MB9AF100">
      
      <!-- *************************  Device 'MB9AF102N'  ***************************** -->
      <device Dname="MB9AF102N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A100A/mb9a100n.h"  define="MB9AF102N"/>
        <debug      svd="SVD/MB9AF10xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx02_128.FLM"   start="0x00000000"  size="0x20000"                  default="1"/>
        <book       name="Documents/MB9AF102NA-DS706-00022-1v0-E.pdf"                    title="MB9A100A Series Data Sheet"/>
      </device>
      
      <!-- *************************  Device 'MB9AF102R'  ***************************** -->
      <device Dname="MB9AF102R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A100A/mb9a100r.h"  define="MB9AF102R"/>
        <debug      svd="SVD/MB9AF10xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx02_128.FLM"   start="0x00000000"  size="0x20000"                  default="1"/>
        <book       name="Documents/MB9AF102NA-DS706-00022-1v0-E.pdf"                    title="MB9A100A Series Data Sheet"/>
      </device>
      
      <!-- *************************  Device 'MB9AF104N'  ***************************** -->
      <device Dname="MB9AF104N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A100A/mb9a100n.h"  define="MB9AF104N"/>
        <debug      svd="SVD/MB9AF10xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx04_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <book       name="Documents/MB9AF102NA-DS706-00022-1v0-E.pdf"                    title="MB9A100A Series Data Sheet"/>
      </device>
      
      <!-- *************************  Device 'MB9AF104R'  ***************************** -->
      <device Dname="MB9AF104R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A100A/mb9a100r.h"  define="MB9AF104R"/>
        <debug      svd="SVD/MB9AF10xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx04_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <book       name="Documents/MB9AF102NA-DS706-00022-1v0-E.pdf"                    title="MB9A100A Series Data Sheet"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'MB9AF110'  **************************** -->
      <subFamily DsubFamily="MB9AF110">
      
      <!-- *************************  Device 'MB9AF111K'  ***************************** -->
      <device Dname="MB9AF111K">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A110K/mb9a110k.h"  define="MB9AF111K"/>
        <debug      svd="SVD/MB9AF11xK.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9A310_64.FLM"     start="0x00000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9AF112K-DS706-00030-1v0-E.pdf"                    title="MB9A110K Series Data Sheet"/>
        <feature type="DMA"           n="4"/>
        <feature type="ADC"           n="8"       m="12"/>
        <feature type="MPSerial"      n="4"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="48"/>
      </device>
      
      <!-- *************************  Device 'MB9AF111L'  ***************************** -->
      <device Dname="MB9AF111L">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A110A/mb9a110l.h"  define="MB9AF111L"/>
        <debug      svd="SVD/MB9AF11xL.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx01_64.FLM"    start="0x00000000"  size="0x10000"                  default="1"/>
        <book       name="Documents/MB9AF111LA-DS706-00011-2v0-E.pdf"                    title="MB9A110A Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ADC"           n="9"       m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="64"/>
      </device>
      
      <!-- *************************  Device 'MB9AF111M'  ***************************** -->
      <device Dname="MB9AF111M">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A110A/mb9a110m.h"  define="MB9AF111M"/>
        <debug      svd="SVD/MB9AF11xM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx01_64.FLM"    start="0x00000000"  size="0x10000"                  default="1"/>
        <book       name="Documents/MB9AF111LA-DS706-00011-2v0-E.pdf"                    title="MB9A110A Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="12"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="80"/>
      </device>
      
      <!-- *************************  Device 'MB9AF111N'  ***************************** -->
      <device Dname="MB9AF111N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A110A/mb9a110n.h"  define="MB9AF111N"/>
        <debug      svd="SVD/MB9AF11xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx01_64.FLM"    start="0x00000000"  size="0x10000"                  default="1"/>
        <book       name="Documents/MB9AF111LA-DS706-00011-2v0-E.pdf"                    title="MB9A110A Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9AF112K'  ***************************** -->
      <device Dname="MB9AF112K">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A110K/mb9a110k.h"  define="MB9AF112K"/>
        <debug      svd="SVD/MB9AF11xK.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9A310_128.FLM"    start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9AF112K-DS706-00030-1v0-E.pdf"                    title="MB9A110K Series Data Sheet"/>
        <feature type="DMA"           n="4"/>
        <feature type="ADC"           n="8"       m="12"/>
        <feature type="MPSerial"      n="4"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="48"/>
      </device>
      
      <!-- *************************  Device 'MB9AF112L'  ***************************** -->
      <device Dname="MB9AF112L">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A110A/mb9a110l.h"  define="MB9AF112L"/>
        <debug      svd="SVD/MB9AF11xL.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx02_128.FLM"   start="0x00000000"  size="0x20000"                  default="1"/>
        <book       name="Documents/MB9AF111LA-DS706-00011-2v0-E.pdf"                    title="MB9A110A Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ADC"           n="9"       m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="64"/>
      </device>
      
      <!-- *************************  Device 'MB9AF112M'  ***************************** -->
      <device Dname="MB9AF112M">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A110A/mb9a110m.h"  define="MB9AF112M"/>
        <debug      svd="SVD/MB9AF11xM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx02_128.FLM"   start="0x00000000"  size="0x20000"                  default="1"/>
        <book       name="Documents/MB9AF111LA-DS706-00011-2v0-E.pdf"                    title="MB9A110A Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="12"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="80"/>
      </device>
      
      <!-- *************************  Device 'MB9AF112N'  ***************************** -->
      <device Dname="MB9AF112N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A110A/mb9a110n.h"  define="MB9AF112N"/>
        <debug      svd="SVD/MB9AF11xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx02_128.FLM"   start="0x00000000"  size="0x20000"                  default="1"/>
        <book       name="Documents/MB9AF111LA-DS706-00011-2v0-E.pdf"                    title="MB9A110A Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9AF114L'  ***************************** -->
      <device Dname="MB9AF114L">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A110A/mb9a110l.h"  define="MB9AF114L"/>
        <debug      svd="SVD/MB9AF11xL.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx04_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <book       name="Documents/MB9AF111LA-DS706-00011-2v0-E.pdf"                    title="MB9A110A Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ADC"           n="9"       m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="64"/>
      </device>
      
