XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3Basic_DFP.pdsc
      <!-- *************************  Device 'MB9AF314L'  ***************************** -->
      <device Dname="MB9AF314L">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A310A/mb9a310l.h"  define="MB9AF314L"/>
        <debug      svd="SVD/MB9AF31xL.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx04_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <book       name="Documents/MB9AF311LA-DS706-00012-2v0-E.pdf"                    title="MB9A310A Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ADC"           n="9"       m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="64"/>
      </device>
      
      <!-- *************************  Device 'MB9AF314M'  ***************************** -->
      <device Dname="MB9AF314M">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A310A/mb9a310m.h"  define="MB9AF314M"/>
        <debug      svd="SVD/MB9AF31xM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx04_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <book       name="Documents/MB9AF311LA-DS706-00012-2v0-E.pdf"                    title="MB9A310A Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="12"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="80"/>
      </device>
      
      <!-- *************************  Device 'MB9AF314N'  ***************************** -->
      <device Dname="MB9AF314N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A310A/mb9a310n.h"  define="MB9AF314N"/>
        <debug      svd="SVD/MB9AF31xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx04_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <book       name="Documents/MB9AF311LA-DS706-00012-2v0-E.pdf"                    title="MB9A310A Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9AF315M'  ***************************** -->
      <device Dname="MB9AF315M">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A310A/mb9a310m.h"  define="MB9AF315M"/>
        <debug      svd="SVD/MB9AF31xM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx05_384.FLM"   start="0x00000000"  size="0x60000"                  default="1"/>
        <book       name="Documents/MB9AF311LA-DS706-00012-2v0-E.pdf"                    title="MB9A310A Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="12"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="80"/>
      </device>
      
      <!-- *************************  Device 'MB9AF315N'  ***************************** -->
      <device Dname="MB9AF315N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A310A/mb9a310n.h"  define="MB9AF315N"/>
        <debug      svd="SVD/MB9AF31xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx05_384.FLM"   start="0x00000000"  size="0x60000"                  default="1"/>
        <book       name="Documents/MB9AF311LA-DS706-00012-2v0-E.pdf"                    title="MB9A310A Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9AF316M'  ***************************** -->
      <device Dname="MB9AF316M">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A310A/mb9a310m.h"  define="MB9AF316M"/>
        <debug      svd="SVD/MB9AF31xM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <book       name="Documents/MB9AF311LA-DS706-00012-2v0-E.pdf"                    title="MB9A310A Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="12"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="80"/>
      </device>
      
      <!-- *************************  Device 'MB9AF316N'  ***************************** -->
      <device Dname="MB9AF316N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A310A/mb9a310n.h"  define="MB9AF316N"/>
        <debug      svd="SVD/MB9AF31xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <book       name="Documents/MB9AF311LA-DS706-00012-2v0-E.pdf"                    title="MB9A310A Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="100"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'MB9AF420'  **************************** -->
      <subFamily DsubFamily="MB9AF420">
      
      <!-- *************************  Device 'MB9AF421K'  ***************************** -->
      <device Dname="MB9AF421K">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A420L/mb9a420k.h"  define="MB9AF421K"/>
        <debug      svd="SVD/MB9AF42xK.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9A420L_64.FLM"    start="0x00000000"  size="0x10000"                  default="1"/>
        <book       name="Documents/MB9AF421L-DS706-00054-0v01-E.pdf"                    title="MB9A420L Series Data Sheet"/>
      </device>
      
      <!-- *************************  Device 'MB9AF421L'  ***************************** -->
      <device Dname="MB9AF421L">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A420L/mb9a420l.h"  define="MB9AF421L"/>
        <debug      svd="SVD/MB9AF42xL.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9A420L_64.FLM"    start="0x00000000"  size="0x10000"                  default="1"/>
        <book       name="Documents/MB9AF421L-DS706-00054-0v01-E.pdf"                    title="MB9A420L Series Data Sheet"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'MB9BF120'  **************************** -->
      <subFamily DsubFamily="MB9BF120">
      
      <!-- *************************  Device 'MB9BF121J'  ***************************** -->
      <device Dname="MB9BF121J">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MB9B120J/mb9b120j.h"  define="MB9BF121J"/>
        <debug      svd="SVD/MB9BF12xJ.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFF000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9B120J_64.FLM"    start="0x00000000"  size="0x10000"                  default="1"/>
        <book       name="Documents/MB9BF121J-DS706-00053-0v01-E.pdf"                    title="MB9B120J Series Data Sheet"/>
      </device>
      
      <!-- *************************  Device 'MB9BF121K'  ***************************** -->
      <device Dname="MB9BF121K">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MB9B120M/mb9b120k.h"  define="MB9BF121K"/>
        <debug      svd="SVD/MB9BF12xK.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_64.FLM"     start="0x00000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF124M-DS706-00050-1v0-E.pdf"                    title="MB9B120M Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ADC"           n="14"      m="12"/>
        <feature type="MPSerial"      n="4"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="48"/>
      </device>
      
      <!-- *************************  Device 'MB9BF121L'  ***************************** -->
      <device Dname="MB9BF121L">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MB9B120M/mb9b120l.h"  define="MB9BF121L"/>
        <debug      svd="SVD/MB9BF12xL.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_64.FLM"     start="0x00000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF124M-DS706-00050-1v0-E.pdf"                    title="MB9B120M Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ADC"           n="23"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="64"/>
      </device>
      
      <!-- *************************  Device 'MB9BF121M'  ***************************** -->
      <device Dname="MB9BF121M">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MB9B120M/mb9b120m.h"  define="MB9BF121M"/>
        <debug      svd="SVD/MB9BF12xM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_64.FLM"     start="0x00000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF124M-DS706-00050-1v0-E.pdf"                    title="MB9B120M Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ADC"           n="26"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="80"/>
      </device>
      
      <!-- *************************  Device 'MB9BF122K'  ***************************** -->
      <device Dname="MB9BF122K">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MB9B120M/mb9b120k.h"  define="MB9BF122K"/>
        <debug      svd="SVD/MB9BF12xK.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_128.FLM"    start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF124M-DS706-00050-1v0-E.pdf"                    title="MB9B120M Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ADC"           n="14"      m="12"/>
        <feature type="MPSerial"      n="4"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="48"/>
      </device>
      
      <!-- *************************  Device 'MB9BF122L'  ***************************** -->
      <device Dname="MB9BF122L">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MB9B120M/mb9b120l.h"  define="MB9BF122L"/>
        <debug      svd="SVD/MB9BF12xL.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_128.FLM"    start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF124M-DS706-00050-1v0-E.pdf"                    title="MB9B120M Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ADC"           n="23"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="64"/>
      </device>
      
      <!-- *************************  Device 'MB9BF122M'  ***************************** -->
      <device Dname="MB9BF122M">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MB9B120M/mb9b120m.h"  define="MB9BF122M"/>
        <debug      svd="SVD/MB9BF12xM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_128.FLM"    start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF124M-DS706-00050-1v0-E.pdf"                    title="MB9B120M Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ADC"           n="26"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="80"/>
      </device>
      
