XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3Basic_DFP.pdsc
      <!-- *************************  Device 'MB9BF124K'  ***************************** -->
      <device Dname="MB9BF124K">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MB9B120M/mb9b120k.h"  define="MB9BF124K"/>
        <debug      svd="SVD/MB9BF12xK.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF124M-DS706-00050-1v0-E.pdf"                    title="MB9B120M Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ADC"           n="14"      m="12"/>
        <feature type="MPSerial"      n="4"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="48"/>
      </device>
      
      <!-- *************************  Device 'MB9BF124L'  ***************************** -->
      <device Dname="MB9BF124L">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MB9B120M/mb9b120l.h"  define="MB9BF124L"/>
        <debug      svd="SVD/MB9BF12xL.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF124M-DS706-00050-1v0-E.pdf"                    title="MB9B120M Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ADC"           n="23"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="64"/>
      </device>
      
      <!-- *************************  Device 'MB9BF124M'  ***************************** -->
      <device Dname="MB9BF124M">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MB9B120M/mb9b120m.h"  define="MB9BF124M"/>
        <debug      svd="SVD/MB9BF12xM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF124M-DS706-00050-1v0-E.pdf"                    title="MB9B120M Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ADC"           n="26"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="80"/>
      </device>
      
      <!-- *************************  Device 'MB9BF128S'  ***************************** -->
      <device Dname="MB9BF128S">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="60000000"/>
        <compile header="Device/Include/MB9B120T/mb9b120s.h"  define="MB9BF128S"/>
        <debug      svd="SVD/MB9BF12xS.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00508000"  size="0x10000"    startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x14000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFEC000"  size="0x14000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9B520T_1024.FLM"  start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/MB9B520T_ROM1.FLM"  start="0x00508000"  size="0x10000"                  default="1"/>
        <book       name="Documents/MB9B120T-DS706-00063.pdf"                          title="MB9B120T Series Data Sheet"/>
      </device>
      
      <!-- *************************  Device 'MB9BF128T'  ***************************** -->
      <device Dname="MB9BF128T">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="60000000"/>
        <compile header="Device/Include/MB9B120T/mb9b120t.h"  define="MB9BF128T"/>
        <debug      svd="SVD/MB9BF12xT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00508000"  size="0x10000"    startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x14000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFEC000"  size="0x14000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9B520T_1024.FLM"  start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/MB9B520T_ROM1.FLM"  start="0x00508000"  size="0x10000"                  default="1"/>
        <book       name="Documents/MB9B120T-DS706-00063.pdf"                          title="MB9B120T Series Data Sheet"/>
      </device>
      
