XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3Basic_DFP.pdsc
      <!-- *************************  Device 'MB9BF324L'  ***************************** -->
      <device Dname="MB9BF324L">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9B320M/mb9b320l.h"  define="MB9BF324L"/>
        <debug      svd="SVD/MB9BF32xL.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF324M-DS706-00049-1v0-E.pdf"                    title="MB9B320M Series Data Sheet"/>
        <feature type="ADC"           n="23"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="64"/>
      </device>
      
      <!-- *************************  Device 'MB9BF324M'  ***************************** -->
      <device Dname="MB9BF324M">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9B320M/mb9b320m.h"  define="MB9BF324M"/>
        <debug      svd="SVD/MB9BF32xM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF324M-DS706-00049-1v0-E.pdf"                    title="MB9B320M Series Data Sheet"/>
        <feature type="ADC"           n="26"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="80"/>
      </device>
      
      <!-- *************************  Device 'MB9BF328S'  ***************************** -->
      <device Dname="MB9BF328S">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="60000000"/>
        <compile header="Device/Include/MB9B320T/mb9b320s.h"  define="MB9BF328S"/>
        <debug      svd="SVD/MB9BF32xS.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00508000"  size="0x10000"    startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x14000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFEC000"  size="0x14000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9B520T_1024.FLM"  start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/MB9B520T_ROM1.FLM"  start="0x00508000"  size="0x10000"                  default="1"/>
        <book       name="Documents/MB9B320T-DS706-00062.pdf"                           title="MB9B320T Series Data Sheet"/>
      </device>
      
      <!-- *************************  Device 'MB9BF328T'  ***************************** -->
      <device Dname="MB9BF328T">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="60000000"/>
        <compile header="Device/Include/MB9B320T/mb9b320t.h"  define="MB9BF328T"/>
        <debug      svd="SVD/MB9BF32xT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00508000"  size="0x10000"    startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x14000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFEC000"  size="0x14000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9B520T_1024.FLM"  start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/MB9B520T_ROM1.FLM"  start="0x00508000"  size="0x10000"                  default="1"/>
        <book       name="Documents/MB9B320T-DS706-00062.pdf"                           title="MB9B320T Series Data Sheet"/>
      </device>
      
      <!-- *************************  Device 'MB9BF329S'  ***************************** -->
      <device Dname="MB9BF329S">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="60000000"/>
        <compile header="Device/Include/MB9B320T/mb9b320s.h"  define="MB9BF329S"/>
        <debug      svd="SVD/MB9BF32xS.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x180000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00508000"  size="0x10000"    startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFE8000"  size="0x18000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9B520T_1536.FLM"  start="0x00000000"  size="0x180000"                 default="1"/>
        <algorithm  name="Flash/MB9B520T_ROM1.FLM"  start="0x00508000"  size="0x10000"                  default="1"/>
        <book       name="Documents/MB9B320T-DS706-00062.pdf"                           title="MB9B320T Series Data Sheet"/>
      </device>
      
