XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3Basic_DFP.pdsc
      <!-- *************************  Device 'MB9BF329T'  ***************************** -->
      <device Dname="MB9BF329T">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="60000000"/>
        <compile header="Device/Include/MB9B320T/mb9b320t.h"  define="MB9BF329T"/>
        <debug      svd="SVD/MB9BF32xT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x180000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00508000"  size="0x10000"    startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFE8000"  size="0x18000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9B520T_1536.FLM"  start="0x00000000"  size="0x180000"                 default="1"/>
        <algorithm  name="Flash/MB9B520T_ROM1.FLM"  start="0x00508000"  size="0x10000"                  default="1"/>
        <book       name="Documents/MB9B320T-DS706-00062.pdf"                           title="MB9B320T Series Data Sheet"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'MB9BF420'  **************************** -->
      <subFamily DsubFamily="MB9BF420">
      
      <!-- *************************  Device 'MB9BF428S'  ***************************** -->
      <device Dname="MB9BF428S">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="60000000"/>
        <compile header="Device/Include/MB9B420T/mb9b420s.h"  define="MB9BF428S"/>
        <debug      svd="SVD/MB9BF42xS.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00508000"  size="0x10000"    startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x14000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFEC000"  size="0x14000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9B520T_1024.FLM"  start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/MB9B520T_ROM1.FLM"  start="0x00508000"  size="0x10000"                  default="1"/>
        <book       name="Documents/MB9B420T-DS706-00061.pdf"                          title="MB9B420T Series Data Sheet"/>
      </device>
      
      <!-- *************************  Device 'MB9BF428T'  ***************************** -->
      <device Dname="MB9BF428T">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="60000000"/>
        <compile header="Device/Include/MB9B420T/mb9b420t.h"  define="MB9BF428T"/>
        <debug      svd="SVD/MB9BF42xT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00508000"  size="0x10000"    startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x14000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFEC000"  size="0x14000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9B520T_1024.FLM"  start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/MB9B520T_ROM1.FLM"  start="0x00508000"  size="0x10000"                  default="1"/>
        <book       name="Documents/MB9B420T-DS706-00061.pdf"                          title="MB9B420T Series Data Sheet"/>
      </device>
      
      <!-- *************************  Device 'MB9BF429S'  ***************************** -->
      <device Dname="MB9BF429S">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="60000000"/>
        <compile header="Device/Include/MB9B420T/mb9b420s.h"  define="MB9BF429S"/>
        <debug      svd="SVD/MB9BF42xS.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x180000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00508000"  size="0x10000"    startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFE8000"  size="0x18000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9B520T_1536.FLM"  start="0x00000000"  size="0x180000"                 default="1"/>
        <algorithm  name="Flash/MB9B520T_ROM1.FLM"  start="0x00508000"  size="0x10000"                  default="1"/>
        <book       name="Documents/MB9B420T-DS706-00061.pdf"                          title="MB9B420T Series Data Sheet"/>
      </device>
      
      <!-- *************************  Device 'MB9BF429T'  ***************************** -->
      <device Dname="MB9BF429T">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="60000000"/>
        <compile header="Device/Include/MB9B420T/mb9b420t.h"  define="MB9BF429T"/>
        <debug      svd="SVD/MB9BF42xT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x180000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00508000"  size="0x10000"    startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFE8000"  size="0x18000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9B520T_1536.FLM"  start="0x00000000"  size="0x180000"                 default="1"/>
        <algorithm  name="Flash/MB9B520T_ROM1.FLM"  start="0x00508000"  size="0x10000"                  default="1"/>
        <book       name="Documents/MB9B420T-DS706-00061.pdf"                          title="MB9B420T Series Data Sheet"/>
      </device>
      </subFamily>

