XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3Basic_DFP.pdsc
      <!-- ************************  Subfamily 'MB9BF520'  **************************** -->
      <subFamily DsubFamily="MB9BF520">
        <feature type="DMA"           n="8"/>
        <feature type="CAN"           n="1"/>
        <feature type="USBD"          n="1"/>
      
      <!-- *************************  Device 'MB9BF521K'  ***************************** -->
      <device Dname="MB9BF521K">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MB9B520M/mb9b520k.h"  define="MB9BF521K"/>
        <debug      svd="SVD/MB9BF52xK.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_64.FLM"     start="0x00000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF524M-DS706-00048-1v0-E.pdf"                    title="MB9B520M Series Data Sheet"/>
        <feature type="ADC"           n="14"      m="12"/>
        <feature type="MPSerial"      n="4"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="48"/>
      </device>
      
      <!-- *************************  Device 'MB9BF521L'  ***************************** -->
      <device Dname="MB9BF521L">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MB9B520M/mb9b520l.h"  define="MB9BF521L"/>
        <debug      svd="SVD/MB9BF52xL.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_64.FLM"     start="0x00000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF524M-DS706-00048-1v0-E.pdf"                    title="MB9B520M Series Data Sheet"/>
        <feature type="ADC"           n="23"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="64"/>
      </device>
      
      <!-- *************************  Device 'MB9BF521M'  ***************************** -->
      <device Dname="MB9BF521M">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MB9B520M/mb9b520m.h"  define="MB9BF521M"/>
        <debug      svd="SVD/MB9BF52xM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_64.FLM"     start="0x00000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF524M-DS706-00048-1v0-E.pdf"                    title="MB9B520M Series Data Sheet"/>
        <feature type="ADC"           n="26"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="80"/>
      </device>
      
      <!-- *************************  Device 'MB9BF522K'  ***************************** -->
      <device Dname="MB9BF522K">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MB9B520M/mb9b520k.h"  define="MB9BF522K"/>
        <debug      svd="SVD/MB9BF52xK.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_128.FLM"    start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF524M-DS706-00048-1v0-E.pdf"                    title="MB9B520M Series Data Sheet"/>
        <feature type="ADC"           n="14"      m="12"/>
        <feature type="MPSerial"      n="4"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="48"/>
      </device>
      
      <!-- *************************  Device 'MB9BF522L'  ***************************** -->
      <device Dname="MB9BF522L">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MB9B520M/mb9b520l.h"  define="MB9BF522L"/>
        <debug      svd="SVD/MB9BF52xL.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_128.FLM"    start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF524M-DS706-00048-1v0-E.pdf"                    title="MB9B520M Series Data Sheet"/>
        <feature type="ADC"           n="23"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="64"/>
      </device>
      
      <!-- *************************  Device 'MB9BF522M'  ***************************** -->
      <device Dname="MB9BF522M">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MB9B520M/mb9b520m.h"  define="MB9BF522M"/>
        <debug      svd="SVD/MB9BF52xM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_128.FLM"    start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF524M-DS706-00048-1v0-E.pdf"                    title="MB9B520M Series Data Sheet"/>
        <feature type="ADC"           n="26"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="80"/>
      </device>
      
      <!-- *************************  Device 'MB9BF524K'  ***************************** -->
      <device Dname="MB9BF524K">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MB9B520M/mb9b520k.h"  define="MB9BF524K"/>
        <debug      svd="SVD/MB9BF52xK.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF524M-DS706-00048-1v0-E.pdf"                    title="MB9B520M Series Data Sheet"/>
        <feature type="ADC"           n="14"      m="12"/>
        <feature type="MPSerial"      n="4"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="48"/>
      </device>
      
