XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3Basic_DFP.pdsc
      <!-- *************************  Device 'MB9BF524L'  ***************************** -->
      <device Dname="MB9BF524L">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MB9B520M/mb9b520l.h"  define="MB9BF524L"/>
        <debug      svd="SVD/MB9BF52xL.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF524M-DS706-00048-1v0-E.pdf"                    title="MB9B520M Series Data Sheet"/>
        <feature type="ADC"           n="23"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="64"/>
      </device>
      
      <!-- *************************  Device 'MB9BF524M'  ***************************** -->
      <device Dname="MB9BF524M">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/MB9B520M/mb9b520m.h"  define="MB9BF524M"/>
        <debug      svd="SVD/MB9BF52xM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF524M-DS706-00048-1v0-E.pdf"                    title="MB9B520M Series Data Sheet"/>
        <feature type="ADC"           n="26"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="IOs"           n="80"/>
      </device>
      
      <!-- *************************  Device 'MB9BF528S'  ***************************** -->
      <device Dname="MB9BF528S">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="60000000"/>
        <compile header="Device/Include/MB9B520T/mb9b520s.h"  define="MB9BF528S"/>
        <debug      svd="SVD/MB9BF52xS.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00508000"  size="0x10000"    startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x14000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFEC000"  size="0x14000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9B520T_1024.FLM"  start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/MB9B520T_ROM1.FLM"  start="0x00508000"  size="0x10000"                  default="1"/>
        <book       name="Documents/MB9B520T-DS706-00060.pdf"                           title="MB9B520S Series Data Sheet"/>
      </device>
      
      <!-- *************************  Device 'MB9BF528T'  ***************************** -->
      <device Dname="MB9BF528T">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="60000000"/>
        <compile header="Device/Include/MB9B520T/mb9b520t.h"  define="MB9BF528T"/>
        <debug      svd="SVD/MB9BF52xT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00508000"  size="0x10000"    startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x14000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFEC000"  size="0x14000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9B520T_1024.FLM"  start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/MB9B520T_ROM1.FLM"  start="0x00508000"  size="0x10000"                  default="1"/>
        <book       name="Documents/MB9B520T-DS706-00060.pdf"                           title="MB9B520S Series Data Sheet"/>
      </device>
      
      <!-- *************************  Device 'MB9BF529S'  ***************************** -->
      <device Dname="MB9BF529S">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="60000000"/>
        <compile header="Device/Include/MB9B520T/mb9b520s.h"  define="MB9BF529S"/>
        <debug      svd="SVD/MB9BF52xS.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x180000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00508000"  size="0x10000"    startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFE8000"  size="0x18000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9B520T_1536.FLM"  start="0x00000000"  size="0x180000"                 default="1"/>
        <algorithm  name="Flash/MB9B520T_ROM1.FLM"  start="0x00508000"  size="0x10000"                  default="1"/>
        <book       name="Documents/MB9B520T-DS706-00060.pdf"                           title="MB9B520S Series Data Sheet"/>
      </device>
      
