XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3Basic_DFP.pdsc
      <!-- *************************  Device 'MB9BF529T'  ***************************** -->
      <device Dname="MB9BF529T">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="60000000"/>
        <compile header="Device/Include/MB9B520T/mb9b520t.h"  define="MB9BF529T"/>
        <debug      svd="SVD/MB9BF52xT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x180000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00508000"  size="0x10000"    startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFE8000"  size="0x18000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9B520T_1536.FLM"  start="0x00000000"  size="0x180000"                 default="1"/>
        <algorithm  name="Flash/MB9B520T_ROM1.FLM"  start="0x00508000"  size="0x10000"                  default="1"/>
        <book       name="Documents/MB9B520T-DS706-00060.pdf"                           title="MB9B520S Series Data Sheet"/>
      </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- conditions are dependecy rules that can apply to a component or an individual file -->
    <condition id="Compiler ARM">
      <!-- conditions selecting ARM Compiler -->
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="MB9A100A">
      <description>Cypress FM3 MB9A100A Device</description>
      <require Dvendor="Cypress:19"/>
      <accept  Dname="MB9AF102N"/>
      <accept  Dname="MB9AF102R"/>
      <accept  Dname="MB9AF104N"/>
      <accept  Dname="MB9AF104R"/>
    </condition>

    <condition id="MB9A110K">
      <description>Cypress FM3 MB9A110K Device</description>
      <require Dvendor="Cypress:19"/>
      <accept  Dname="MB9AF111K"/>
      <accept  Dname="MB9AF112K"/>
    </condition>

    <condition id="MB9A110A">
      <description>Cypress FM3 MB9A110A Device</description>
      <require Dvendor="Cypress:19"/>
      <accept  Dname="MB9AF111L"/>
      <accept  Dname="MB9AF111M"/>
      <accept  Dname="MB9AF111N"/>
      <accept  Dname="MB9AF112L"/>
      <accept  Dname="MB9AF112M"/>
      <accept  Dname="MB9AF112N"/>
      <accept  Dname="MB9AF114L"/>
      <accept  Dname="MB9AF114M"/>
      <accept  Dname="MB9AF114N"/>
      <accept  Dname="MB9AF115M"/>
      <accept  Dname="MB9AF115N"/>
      <accept  Dname="MB9AF116M"/>
      <accept  Dname="MB9AF116N"/>
    </condition>

    <condition id="MB9A120L">
      <description>Cypress FM3 MB9A120L Device</description>
      <require Dvendor="Cypress:19"/>
      <accept  Dname="MB9AF121K"/>
      <accept  Dname="MB9AF121L"/>
    </condition>

    <condition id="MB9A310K">
      <description>Cypress FM3 MB9A310K Device</description>
      <require Dvendor="Cypress:19"/>
      <accept  Dname="MB9AF311K"/>
      <accept  Dname="MB9AF312K"/>
    </condition>

    <condition id="MB9A310A">
      <description>Cypress FM3 MB9A310A Device</description>
      <require Dvendor="Cypress:19"/>
      <accept  Dname="MB9AF311L"/>
      <accept  Dname="MB9AF311M"/>
      <accept  Dname="MB9AF311N"/>
      <accept  Dname="MB9AF312L"/>
      <accept  Dname="MB9AF312M"/>
      <accept  Dname="MB9AF312N"/>
      <accept  Dname="MB9AF314L"/>
      <accept  Dname="MB9AF314M"/>
      <accept  Dname="MB9AF314N"/>
      <accept  Dname="MB9AF315M"/>
      <accept  Dname="MB9AF315N"/>
      <accept  Dname="MB9AF316M"/>
      <accept  Dname="MB9AF316N"/>
    </condition>

    <condition id="MB9A420L">
      <description>Cypress FM3 MB9A420L Device</description>
      <require Dvendor="Cypress:19"/>
      <accept  Dname="MB9AF421K"/>
      <accept  Dname="MB9AF421L"/>
    </condition>

    <condition id="MB9B120J">
      <description>Cypress FM3 MB9B120J Device</description>
      <require Dvendor="Cypress:19"/>
      <accept  Dname="MB9BF121J"/>
    </condition>

    <condition id="MB9B120M">
      <description>Cypress FM3 MB9B120M Device</description>
      <require Dvendor="Cypress:19"/>
      <accept  Dname="MB9BF121K"/>
      <accept  Dname="MB9BF121L"/>
      <accept  Dname="MB9BF121M"/>
      <accept  Dname="MB9BF122K"/>
      <accept  Dname="MB9BF122L"/>
      <accept  Dname="MB9BF122M"/>
      <accept  Dname="MB9BF124K"/>
      <accept  Dname="MB9BF124L"/>
      <accept  Dname="MB9BF124M"/>
    </condition>

    <condition id="MB9B120T">
      <description>Cypress FM3 MB9B120T Device</description>
      <require Dvendor="Cypress:19"/>
      <accept  Dname="MB9BF128S"/>
      <accept  Dname="MB9BF128T"/>
      <accept  Dname="MB9BF129S"/>
      <accept  Dname="MB9BF129T"/>
    </condition>

    <condition id="MB9B320M">
      <description>Cypress FM3 MB9B320M Device</description>
      <require Dvendor="Cypress:19"/>
      <accept  Dname="MB9BF321K"/>
      <accept  Dname="MB9BF321L"/>
      <accept  Dname="MB9BF321M"/>
      <accept  Dname="MB9BF322K"/>
      <accept  Dname="MB9BF322L"/>
      <accept  Dname="MB9BF322M"/>
      <accept  Dname="MB9BF324K"/>
      <accept  Dname="MB9BF324L"/>
      <accept  Dname="MB9BF324M"/>
    </condition>

    <condition id="MB9B320T">
      <description>Cypress FM3 MB9B320T Device</description>
      <require Dvendor="Cypress:19"/>
      <accept  Dname="MB9BF328S"/>
      <accept  Dname="MB9BF328T"/>
      <accept  Dname="MB9BF329S"/>
      <accept  Dname="MB9BF329T"/>
    </condition>

    <condition id="MB9B420T">
      <description>Cypress FM3 MB9B420T Device</description>
      <require Dvendor="Cypress:19"/>
      <accept  Dname="MB9BF428S"/>
      <accept  Dname="MB9BF428T"/>
      <accept  Dname="MB9BF429S"/>
      <accept  Dname="MB9BF429T"/>
    </condition>

    <condition id="MB9B520M">
      <description>Cypress FM3 MB9B520M Device</description>
      <require Dvendor="Cypress:19"/>
      <accept  Dname="MB9BF521K"/>
      <accept  Dname="MB9BF521L"/>
      <accept  Dname="MB9BF521M"/>
      <accept  Dname="MB9BF522K"/>
      <accept  Dname="MB9BF522L"/>
      <accept  Dname="MB9BF522M"/>
      <accept  Dname="MB9BF524K"/>
      <accept  Dname="MB9BF524L"/>
      <accept  Dname="MB9BF524M"/>
    </condition>

    <condition id="MB9B520T">
      <description>Cypress FM3 MB9B520T Device</description>
      <require Dvendor="Cypress:19"/>
      <accept  Dname="MB9BF528S"/>
      <accept  Dname="MB9BF528T"/>
      <accept  Dname="MB9BF529S"/>
      <accept  Dname="MB9BF529T"/>
    </condition>

    <condition id="FM3_BASIC CMSIS Device">
      <description>Cypress FM3 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Cypress:19"/>
      <accept  condition ="MB9A100A"/>
      <accept  condition ="MB9A110K"/>
      <accept  condition ="MB9A110A"/>
      <accept  condition ="MB9A120L"/>
      <accept  condition ="MB9A310K"/>
      <accept  condition ="MB9A310A"/>
      <accept  condition ="MB9A420L"/>
      <accept  condition ="MB9B120J"/>
      <accept  condition ="MB9B120M"/>
      <accept  condition ="MB9B120T"/>
      <accept  condition ="MB9B320M"/>
      <accept  condition ="MB9B320T"/>
      <accept  condition ="MB9B420T"/>
      <accept  condition ="MB9B520M"/>
      <accept  condition ="MB9B520T"/>
    </condition>
