XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3Basic_DFP.pdsc
  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.0.1" condition="FM3_BASIC CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Cypress FM3 device series</description>
      <files>

        <!-- additional include path -->
        <file category="include" name="Device/Include/"/>
        
        <!-- startup files -->
        <file category="source" name="Device/Source/MB9A100A/startup_mb9af10x.s" attr="config"  condition="MB9A100A"/>
        <file category="source" name="Device/Source/MB9A110K/startup_mb9af11x.s" attr="config"  condition="MB9A110K"/>
        <file category="source" name="Device/Source/MB9A110A/startup_mb9af11x.s" attr="config"  condition="MB9A110A"/>
        <file category="source" name="Device/Source/MB9A120L/startup_mb9af12x.s" attr="config"  condition="MB9A120L"/>
        <file category="source" name="Device/Source/MB9A310K/startup_mb9af31x.s" attr="config"  condition="MB9A310K"/>
        <file category="source" name="Device/Source/MB9A310A/startup_mb9af31x.s" attr="config"  condition="MB9A310A"/>
        <file category="source" name="Device/Source/MB9A420L/startup_mb9af42x.s" attr="config"  condition="MB9A420L"/>
        <file category="source" name="Device/Source/MB9B120J/startup_mb9bf12x.s" attr="config"  condition="MB9B120J"/>
        <file category="source" name="Device/Source/MB9B120M/startup_mb9bf12x.s" attr="config"  condition="MB9B120M"/>
        <file category="source" name="Device/Source/MB9B120T/startup_mb9bf12x.s" attr="config"  condition="MB9B120T"/>
        <file category="source" name="Device/Source/MB9B320M/startup_mb9bf32x.s" attr="config"  condition="MB9B320M"/>
        <file category="source" name="Device/Source/MB9B320T/startup_mb9bf32x.s" attr="config"  condition="MB9B320T"/>
        <file category="source" name="Device/Source/MB9B420T/startup_mb9bf42x.s" attr="config"  condition="MB9B420T"/>
        <file category="source" name="Device/Source/MB9B520M/startup_mb9bf52x.s" attr="config"  condition="MB9B520M"/>
        <file category="source" name="Device/Source/MB9B520T/startup_mb9bf52x.s" attr="config"  condition="MB9B520T"/>

        <!-- system file -->
        <file category="source" name="Device/Source/MB9A100A/system_mb9af10x.c"  attr="config"  condition="MB9A100A"/>
        <file category="source" name="Device/Source/MB9A110K/system_mb9af11x.c"  attr="config"  condition="MB9A110K"/>
        <file category="source" name="Device/Source/MB9A110A/system_mb9af11x.c"  attr="config"  condition="MB9A110A"/>
        <file category="source" name="Device/Source/MB9A120L/system_mb9af12x.c"  attr="config"  condition="MB9A120L"/>
        <file category="source" name="Device/Source/MB9A310K/system_mb9af31x.c"  attr="config"  condition="MB9A310K"/>
        <file category="source" name="Device/Source/MB9A310A/system_mb9af31x.c"  attr="config"  condition="MB9A310A"/>
        <file category="source" name="Device/Source/MB9A420L/system_mb9af42x.c"  attr="config"  condition="MB9A420L"/>
        <file category="source" name="Device/Source/MB9B120J/system_mb9bf12x.c"  attr="config"  condition="MB9B120J"/>
        <file category="source" name="Device/Source/MB9B120M/system_mb9bf12x.c"  attr="config"  condition="MB9B120M"/>
        <file category="source" name="Device/Source/MB9B120T/system_mb9bf12x.c"  attr="config"  condition="MB9B120T"/>
        <file category="source" name="Device/Source/MB9B320M/system_mb9bf32x.c"  attr="config"  condition="MB9B320M"/>
        <file category="source" name="Device/Source/MB9B320T/system_mb9bf32x.c"  attr="config"  condition="MB9B320T"/>
        <file category="source" name="Device/Source/MB9B420T/system_mb9bf42x.c"  attr="config"  condition="MB9B420T"/>
        <file category="source" name="Device/Source/MB9B520M/system_mb9bf52x.c"  attr="config"  condition="MB9B520M"/>
        <file category="source" name="Device/Source/MB9B520T/system_mb9bf52x.c"  attr="config"  condition="MB9B520T"/>
      </files>
    </component>
  </components>
  
</package>
